InformationRegisters/DICOMНастройкаСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>DICOMНастройкаСистемы</Name>
			<Comment>Необходимые данные для работы с ТЕКУЩЕЙ системой на выбор, т.е. только с одной, содержит редкоизменяемые необходимые данные - каталоги пути, данные для запросов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>AETLRIS_Внутренний</Name>
					<Comment>AET для модальности, отвечающий за работу RIS-части. К примеру, запрос создающий ворклист адресуется к этой модальности</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.AETitles</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>AETLRIS_Внешний</Name>
					<Comment>AET для модальности, отвечающий за работу RIS-части. К примеру, запрос создающий ворклист адресуется к этой модальности</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.AETitles</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>AETLPACS_Внутренний</Name>
					<Comment>AET для модальности, отвечающий за работу PACS-части. К примеру, запрос на получение учения адресуется к этой модальности</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.AETitles</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>AETLPACS_Внешний</Name>
					<Comment>AET для модальности, отвечающий за работу PACS-части. К примеру, запрос на получение учения адресуется к этой модальности</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.AETitles</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КаталогПутиБатников</Name>
					<Comment>Каталог по которому получается доступ к созданным батникам. Может быть пустым, если система не развертывается</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КаталогКорневогоПутиSQL</Name>
					<Comment>Каталог ведущий к корневой папки установленной системы SQL. Может быть пустым, если для системы оно не требуется</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяСистемы</Name>
					<Comment>Имя системы, которая настраивается. Позволительно иметь только одну систему активно</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/DICOMОборудованиеПоИнструментИсследованиям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>DICOMОборудованиеПоИнструментИсследованиям</Name>
			<Comment>DICOM регистр связи инструментальных исследований (номенклатура) с оборудованием по филиалам</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Исследование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнструментальныеИсследования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Оборудование</Name>
					<Comment>Считаем, что оборудование может быть только в одном филиале</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/DICOMДанныеУченийСРасшифровкой.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>DICOMДанныеУченийСРасшифровкой</Name>
			<Comment>Регистр, где хранятся все записи когда-либо создаваемых DICOM учений в приёмах, имеет достаточные данные для определения учения</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВремяОтправки</Name>
					<Comment>Значение, отображающее дату отправки WL, по нему определяет просроченность учения</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>какую номенклатуру выбрал пользователь в качестве исследования</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдаленПользователем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>StudyUID</Name>
					<Comment>Средний размер 80-90 символов, Признак для определения учения в dcm4chee</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Comment>Документ-родитель, куда сохраняются данные</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SPSUID</Name>
					<Comment>ScheduledProcedureStepID формируется на dcm4chee</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОборудованиеСотрудниковDICOM.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ОборудованиеСотрудниковDICOM</Name>
			<Comment>Legacy</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскоеОборудование</v8:Type>
						<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Оборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Оборудование</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УчаствуетВКалендарномПланировании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланируетсяБезСотрудника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МоделиОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяУслуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойСпособЗаполненияГрафика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыЗаполненияГрафиковРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>удалитьAETitle</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AETitles</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Специализация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_ПлощадьПомещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>омг_Специализации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Специализация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/МедицинскоеОборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>МедицинскоеОборудование</Name>
			<Comment>Оборудование использующееся для </Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФилиалТекущегоРазмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AETitle</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AETitles</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматРендера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/DICOMОбщий/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Прямая транслитерация переданного текста
//
// Параметры:
//  Слово	 - Строка - слово
// 
// Возвращаемое значение:
//  Строка - исправленное слово.
//
Функция ПрямаяТранслитерация(Слово) Экспорт
	
	МакетXML = ПолучитьОбщийМакет("Транслитерация").ПолучитьТекст();
	МакетТаблица = ОбщегоНазначения.ПрочитатьXMLВТаблицу(МакетXML).Данные;
	МакетТаблица.Колонки.Добавить("ПорядокЛатКирЧисло", Новый ОписаниеТипов("Число"));
	МакетТаблица.Колонки.Добавить("ПорядокКирЛатЧисло", Новый ОписаниеТипов("Число"));
	
	Для Каждого СтрокаМакета Из МакетТаблица Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаМакета.ПорядокКирЛат) Тогда
			СтрокаМакета.ПорядокКирЛат = "999";
		Конецесли;
		Если НЕ ЗначениеЗаполнено(СтрокаМакета.ПорядокЛатКир) Тогда
			СтрокаМакета.ПорядокЛатКир = "999";
		Конецесли;
		СтрокаМакета.ПорядокЛатКирЧисло = Число(СтрокаМакета.ПорядокЛатКир);
		СтрокаМакета.ПорядокКирЛатЧисло = Число(СтрокаМакета.ПорядокКирЛат);
	КонецЦикла;
	МакетТаблица.Сортировать("ПорядокКирЛатЧисло,Кириллица");
	КолСимволов = 0;
	НовоеСлово = "";
	Пока КолСимволов < СтрДлина(Слово) Цикл
		Символ = Сред(Слово,КолСимволов+1,1);
		Найдено = Ложь;
		Для Каждого СтрокаМакета Из МакетТаблица Цикл
			Если НРег(Символ) = Нрег(СтрокаМакета.Кириллица) Тогда
				// новый символ с переводом в нужный регистр
				НовыйСимвол = ?(Символ = НРег(СтрокаМакета.Кириллица), НРег(СтрокаМакета.Латиница),ВРег(СтрокаМакета.Латиница));
				Если ЗначениеЗаполнено(СтрокаМакета.СледующиеБуквы) И КолСимволов + 1 < СтрДлина(Слово) Тогда
					// Для буквы ц, например,важно какие следующие буквы и надо заглянуть вперед
					// вперед смотрим если буква не последняя
					СимволСлед = Сред(Слово,КолСимволов+2,1);
					МассивСледБукв = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаМакета.СледующиеБуквы);
					Для каждого ЭлСледБуква Из МассивСледБукв Цикл
						Если НРег(ЭлСледБуква) = НРег(СимволСлед) Тогда
							НовоеСлово = НовоеСлово + НовыйСимвол;
							Найдено = Истина;
							Прервать;
						КонецЕсли;
					КонецЦикла; 
				Иначе
					НовоеСлово = НовоеСлово + НовыйСимвол;
					Найдено = Истина;
				КонецЕсли;
			КонецЕсли;
			Если Найдено = Истина Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если Найдено = Ложь Тогда
			НовоеСлово = НовоеСлово + Символ;
		КонецЕсли;
		КолСимволов = КолСимволов + 1;
	КонецЦикла; 
	
	Возврат НовоеСлово;
	
КонецФункции

// Обратная транслитерация переданного текста.
//
// Параметры:
//  Слово	 - Строка - слово
// 
// Возвращаемое значение:
//  Строка - исправленное слово.
//
Функция ОбратнаяТранслитерация(Слово) Экспорт
	МакетXML = ПолучитьОбщийМакет("Транслитерация").ПолучитьТекст();
	МакетТаблица = ОбщегоНазначения.ПрочитатьXMLВТаблицу(МакетXML).Данные;
	МакетТаблица.Колонки.Добавить("ПорядокЛатКирЧисло", Новый ОписаниеТипов("Число"));
	МакетТаблица.Колонки.Добавить("ПорядокКирЛатЧисло", Новый ОписаниеТипов("Число"));
	
	Для Каждого СтрокаМакета Из МакетТаблица Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаМакета.ПорядокКирЛат) Тогда
			СтрокаМакета.ПорядокКирЛат = "999";
		Конецесли;
		Если НЕ ЗначениеЗаполнено(СтрокаМакета.ПорядокЛатКир) Тогда
			СтрокаМакета.ПорядокЛатКир = "999";
		Конецесли;
		СтрокаМакета.ПорядокЛатКирЧисло = Число(СтрокаМакета.ПорядокЛатКир);
		СтрокаМакета.ПорядокКирЛатЧисло = Число(СтрокаМакета.ПорядокКирЛат);
	КонецЦикла;
	МакетТаблица.Сортировать("ПорядокЛатКирЧисло,Кириллица");
	КолСимволов = 0;
	НовоеСлово = Слово;
	Для Каждого СтрокаМакета Из МакетТаблица Цикл
		НовоеСлово = СтрЗаменить(НовоеСлово,НРег(СтрокаМакета.Латиница),НРег(СтрокаМакета.Кириллица));
		НовоеСлово = СтрЗаменить(НовоеСлово,ВРег(СтрокаМакета.Латиница),ВРег(СтрокаМакета.Кириллица));
	КонецЦикла;
	
	Возврат НовоеСлово;
	
КонецФункции

#КонецОбласти

#Область РаботаСДокументомВладельцем

// Получаем из DICOMНастройкаСистемы какая версия DICOM используется и по ней составляем параметры открытия формы
//
// Возвращаемое значение:
//   Структура, Неопределено - Значение имени используемой системы
//
Функция ПолучитьПараметрыФормыСистемыDICOM(знач СсылкаПрием) Экспорт

	СтруктураПараметрыФормы = Новый Структура("Владелец, ВладелецУИД",СсылкаПрием, СсылкаПрием.УникальныйИдентификатор());
	
	// Поскольку данная команда появляется только при включении константы "ИспользоватьDICOM",
	// То считаем, что отуствие данных в регистре означает использование DCMTK
	МенеджерЗаписи = РегистрыСведений.DICOMНастройкаСистемы.СоздатьМенеджерЗаписи();	
	МенеджерЗаписи.Прочитать();
	
	ИмяСистемы = МенеджерЗаписи.ИмяСистемы;
	Если ИмяСистемы = "DCMTK" ИЛИ ИмяСистемы = "" Тогда 

		// Параметры из приёма
		ПараметрыОткрытияФормы = Новый Структура("ЗакрыватьПриЗакрытииВладельца",Истина);
		ПараметрыОткрытияФормы.Вставить("ДокументВладелец",СсылкаПрием);
		
		СтруктураПараметрыФормы.Вставить("Параметры",ПараметрыОткрытияФормы); 
        СтруктураПараметрыФормы.Вставить("ИмяФормы","Обработка.DICOM_ИсследованияМД.Форма.DCMTK_Основная");
		СтруктураПараметрыФормы.Вставить("РежимОткрытияОкнаФормы",РежимОткрытияОкнаФормы.Независимый);

		
	ИначеЕсли ИмяСистемы = "DCM4CHEE" Тогда
		
		МассивУслуг = ИзменитьМассивУслугДляDICOMПоОборудованию(СсылкаПрием,СсылкаПрием.Филиал);
		
		// Параметры из приёма
		ПараметрыОткрытияФормы = Новый Структура("ЗакрыватьПриЗакрытииВладельца",Истина);
		ПараметрыОткрытияФормы.Вставить("МассивУслуг",МассивУслуг);	
		ПараметрыОткрытияФормы.Вставить("ДокументВладелец",СсылкаПрием);	
		ПараметрыОткрытияФормы.Вставить("Сотрудник",СсылкаПрием.Врач);	
		ПараметрыОткрытияФормы.Вставить("Филиал",СсылкаПрием.Филиал);	
		ПараметрыОткрытияФормы.Вставить("Клиент",СсылкаПрием.Клиент);	
		
		СтруктураПараметрыФормы.Вставить("Параметры",ПараметрыОткрытияФормы); 
		СтруктураПараметрыФормы.Вставить("ИмяФормы","Обработка.DICOM_ИсследованияМД.Форма.DICOMСистемы_Основное");
		СтруктураПараметрыФормы.Вставить("РежимОткрытияОкнаФормы",РежимОткрытияОкнаФормы.Независимый);

	Иначе
		// Попытка работать с системой, которая ещё не поддерживается
		Возврат Неопределено;
	КонецЕсли;

	Возврат СтруктураПараметрыФормы;
	
КонецФункции

// Изменить массив услуг для DICOM по связи его инструментального исследования и мед.оборудования с учетом филиала.
// Изменяет передаваемый массив - удаляет оттуда "неподходящие" ссылки номенклатуры-услуги
//
// Параметры:
//  НачМассивУслуг	 - 	Массив - Массив, содержащий ссылки на номенклатуру
//  ТекФилиал		 - 	СправочникСсылкаФилиалы  - Филиал, в котором оказывается услуга
//
Функция ИзменитьМассивУслугДляDICOMПоОборудованию(СсылкаПрием, Филиал) Экспорт

	// Если в приёме было несколько услуг по количеству - то они будут размещены в массиве в том же количестве, что и в документе.
	
	НоменклатураРабот = СсылкаПрием.Работы.ВыгрузитьКолонку("Номенклатура");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Филиал", Филиал);
	Запрос.УстановитьПараметр("НоменклатураРабот", НоменклатураРабот);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.DICOMОборудованиеПоИнструментИсследованиям КАК DICOMОборудование
	|		ПО Номенклатура.Ссылка В (&НоменклатураРабот)
	|			И (DICOMОборудование.Филиал = &Филиал)
	|			И Номенклатура.ИнструментальноеИсследование = DICOMОборудование.Исследование";	
	НоменклатураИсследований = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	ИсследованияДокумента = Новый Массив;
	Для Каждого СтрокаРаботы Из СсылкаПрием.Работы Цикл
		Если НоменклатураИсследований.Найти(СтрокаРаботы.Номенклатура) <> Неопределено Тогда
			// Если одной номенклатуры несколько - мы просто добавляем столько вариантов в массив (т.к. на одну запись - одно исследование)
			Для КолВо = 1  По СтрокаРаботы.Количество Цикл				
				ИсследованияДокумента.Добавить(СтрокаРаботы.Номенклатура);	
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ИсследованияДокумента;
	
КонецФункции

// Проверяем что в переданном документе были изменены (и записаны) критически важные поля
//	СсылкаПрием - ДокументСсылка - ссылка на документ-родитель
//	СтарыйФилиал - СправочникФилиалСсылка
//  СтарыйКлиент
//Возвращаемые значения:
//	Булево - Истина - да, изменились, Ложь - нет не изменились
//
Функция ДокументИзмененПоКритическимЗначениям(Знач СсылкаПрием, Знач СтарыйФилиал, Знач СтарыйКлиент) Экспорт
	Возврат (СсылкаПрием.Клиент <> СтарыйКлиент)
		Или (СсылкаПрием.Филиал <> СтарыйФилиал);
КонецФункции

#КонецОбласти 

#Область СериализацияДанных

Функция СформироватьМассивСериализации(Знач ТаблицаСтатичных, СсылкаНоменклатура, СсылкаОборудование, ТекДата) Экспорт
															
	ДанныеDICOM = Новый Массив;
	
	// 	Requested Procedure Description и Scheduled Procedure Step Description
	// Описание процедуры, для понимания врача и Описание этапа процедуры, для понимания врача
	ВычПромежДанныеWL = СтрШаблон("%1 %2",DICOMОбщий.ПрямаяТранслитерация(СсылкаНоменклатура.НаименованиеПолное),
									DICOMОбщий.ПрямаяТранслитерация(СсылкаНоменклатура.Артикул));
	УбратьСпецСимволыИзСтроки(ВычПромежДанныеWL);								
	ДанныеDICOM.Добавить(Новый Структура("Тег,Визуализация,Описание,ЗначЗаполнения","б00321060", "LO","RequestedProcedureDescription", ВычПромежДанныеWL));
	ДанныеDICOM.Добавить(Новый Структура("Тег,Визуализация,Описание,ЗначЗаполнения","б00400007", "LO","ScheduledProcedureStepDescription", ВычПромежДанныеWL));
										
	// Scheduled Procedure Step Location  -  Место проведения этапа
	ВычПромежДанныеWL = DICOMОбщий.ПрямаяТранслитерация(СсылкаОборудование.НаименованиеПолное);
	УбратьСпецСимволыИзСтроки(ВычПромежДанныеWL);
	ДанныеDICOM.Добавить(Новый Структура("Тег,Визуализация,Описание,ЗначЗаполнения,ТегРодитель","б00400011", "SH","ScheduledProcedureStepLocation", ВычПромежДанныеWL,"р00400100"));
	
	// Scheduled Station AET itle - ИМЯ AETLа на котором проведится исследование
	ДанныеDICOM.Добавить(Новый Структура("Тег,Визуализация,Описание,ЗначЗаполнения,ТегРодитель","в00400001", "AE","ScheduledStationAETitle",СсылкаОборудование.AETitle,"р00400100"));
	
	// Scheduled Station Name - пользовательское имя устройства который провёл исследование
	ВычПромежДанныеWL = DICOMОбщий.ПрямаяТранслитерация(СсылкаОборудование.Наименование);
	УбратьСпецСимволыИзСтроки(ВычПромежДанныеWL);
	ДанныеDICOM.Добавить(Новый Структура("Тег,Визуализация,Описание,ЗначЗаполнения,ТегРодитель","в00400010", "SH","ScheduledStationName", ВычПромежДанныеWL,"р00400100"));
	
	// Modality - Название кода, который применяется в исследовании к примеру CR (Computed Radiography), CT (Computed Tomography). OT означает "другое"
	ВычПромежДанныеWL = ?(СсылкаНоменклатура.DICOMModality = "","OT",СсылкаНоменклатура.DICOMModality);
	ДанныеDICOM.Добавить(Новый Структура("Тег,Визуализация,Описание,ЗначЗаполнения","в00080060", "CS","Modality", ВычПромежДанныеWL));
	
	//	Requested Procedure ID и Study Instance UID, УИ проводимой процедуры и исследования  
	// UID учения должно состоять из UID пациента + номенклатуры + тек Даты + номера строки в учении
	// Таким образом получится иметь уникальные учения во всех нужных разрезах (пациент, дата,  задваемые номенклатуры )
	ВычПромежДанныеWL =  Строка(СсылкаНоменклатура.УникальныйИдентификатор());
	ДанныеDICOM.Добавить(Новый Структура("Тег,Визуализация,Описание,ЗначЗаполнения","б00401001", "SH","RequestedProcedureID", ВычПромежДанныеWL));
		
	// Относительно статичные значения параметров, которые нужно вычислять помещены сюда
	ДанныеDICOM.Добавить(Новый Структура("Тег,Визуализация,Описание,ЗначЗаполнения,ТегРодитель","в00400002", "DA","ScheduledProcedureStepStartDate", Формат(ТекДата, "ДФ=yyyyMMdd"),"р00400100"));
	ДанныеDICOM.Добавить(Новый Структура("Тег,Визуализация,Описание,ЗначЗаполнения,ТегРодитель","в00400003", "TM","ScheduledProcedureStepStartTime", Формат(ТекДата, "ДФ=HHmmss"),"р00400100"));
	
	//Scheduled Procedure Step Start DateTime 
	// ДатаВремя для начала шага процедуры, нет чёткого описания как она должна выглядеть, поэтому это совмещённый формат даты и времени
	ДанныеDICOM.Добавить(Новый Структура("Тег,Визуализация,Описание,ЗначЗаполнения","н00404005","DT","ScheduledProcedureStepStartDateTime",Формат(ТекДата, "ДФ=yyyyMMddHHmmss")));	
	
	// (ДЛЯ РАЗРАБОТКИ) Складируем потенциальные значения из предыдущего вида
	//ВытянутыеДанныеДляWorklist.Добавить("","Allergies");
	//ВытянутыеДанныеДляWorklist.Добавить("","AccessionNumber");
	//ВытянутыеДанныеДляWorklist.Добавить("","CommentsOnScheduledProcedureStep");
	//ВытянутыеДанныеДляWorklist.Добавить("","MedicalAlerts");
	//ВытянутыеДанныеДляWorklist.Добавить("","PreMedication");
	//ВытянутыеДанныеДляWorklist.Добавить("","RequestedContrastAgent");
	//ВытянутыеДанныеДляWorklist.Добавить("","ScheduledProcedureStepSequence");
	
	
	// Для разработки. Мы храним статичные данные (которые для каждой единицы номенклатуры одинаковые) в таблице ВытянутыеДанныеДляWorklistСтатичные
	ТаблицаДанныхСериализации = ТаблицаСтатичных.Выгрузить();
	
	Для каждого СтрокаСтруктуры Из ДанныеDICOM Цикл	
		НоваяСтрокаДанных = ТаблицаДанныхСериализации.Добавить();	
		ЗаполнитьЗначенияСвойств(НоваяСтрокаДанных,СтрокаСтруктуры);	
	КонецЦикла;
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаДанныхСериализации);
	
КонецФункции 

Процедура УбратьСпецСимволыИзСтроки(СтрокаДляРаботы)
	
	СтрокаДляРаботы = СтрЗаменить(СтрокаДляРаботы,".",""); 
	СтрокаДляРаботы = СтрЗаменить(СтрокаДляРаботы,",","");
    СтрокаДляРаботы = СтрЗаменить(СтрокаДляРаботы,"'","");
    СтрокаДляРаботы = СтрЗаменить(СтрокаДляРаботы,"""","");
    СтрокаДляРаботы = СтрЗаменить(СтрокаДляРаботы,"_"," ");
    СтрокаДляРаботы = СтрЗаменить(СтрокаДляРаботы,"-"," ");
    СтрокаДляРаботы = СтрЗаменить(СтрокаДляРаботы,"!","");
    СтрокаДляРаботы = СтрЗаменить(СтрокаДляРаботы,"?","");
    СтрокаДляРаботы = СтрЗаменить(СтрокаДляРаботы,"*",""); 
	
КонецПроцедуры

#КонецОбласти

#Область НастройкиDICOM
 // узнаём из регистра настройки DICOM LEGACY ли версия используется
 // Вовзвращаемое значение:
 // 	Булево - истина, если нет данных или старая версия
Функция ИспользуетсяСтараяВерсия() Экспорт

	МенеджерЗаписи = РегистрыСведений.DICOMНастройкаСистемы.СоздатьМенеджерЗаписи();	
	МенеджерЗаписи.Прочитать();
	
	Возврат((МенеджерЗаписи.ИмяСистемы = "DCMTK" ИЛИ МенеджерЗаписи.ИмяСистемы = ""));

КонецФункции

// Ставим значения из регистра DICOMНастройкаСистемы для использования 
// КлиентПодключенЧерезВебСервер - Булево - ОбщегоНазначенияКлиент.КлиентПодключенЧерезВебСервер()
// Вовзвращаемое значение:
// 	СписокЗначений, Неопределено - Список значений DICOM, где значение является именем, а представление - строковым значением
//								Неопределено возвращается если внешнее подключение запрещено или не поддерживается
//
Функция ЗаполнитьНастройкиСистемыDICOM(КлиентПодключенЧерезВебСервер) Экспорт
	
	// Поскольку мы должны сохранить значения в форме, где будет использованы настройки - делаем СписокЗначений, а не Соответствие
	НастройкиСистемыDICOM = Новый СписокЗначений;
	
	// Доступна только одна строка, получаем её, если она есть
	МенеджерЗаписи = РегистрыСведений.DICOMНастройкаСистемы.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Прочитать();

	// Заполним: ИмяСистемы
	НастройкиСистемыDICOM.Добавить("ИмяСистемыDICOM",МенеджерЗаписи.ИмяСистемы);
	
	// Проверяем где расположен RIS/PACS - в локальной сети или общей, от этого и возвращаем
	// Либо локальное представление, либо внешнее
	Если КлиентПодключенЧерезВебСервер Тогда
		
		// БЕЗ  KeyCloak реализации - запрещаем внешнее подключение (без VPN). Т.к. запросы работать не будут
		Возврат Неопределено;
		
		// Внешнее соединение
		// AETLМенеджера
		НастройкиСистемыDICOM.Добавить("AETLМенеджера",Строка(МенеджерЗаписи.AETLPACS_Внешний));
		НастройкиСистемыDICOM.Добавить("AETLМенеджераПорт",Формат(МенеджерЗаписи.AETLPACS_Внешний.Port,"ЧГ="));
		НастройкиСистемыDICOM.Добавить("AETLМенеджераХост",МенеджерЗаписи.AETLPACS_Внешний.Host);
		
		// AETLЛистов
		НастройкиСистемыDICOM.Добавить("AETLЛистов",Строка(МенеджерЗаписи.AETLRIS_Внешний));
		НастройкиСистемыDICOM.Добавить("AETLЛистовПорт",Формат(МенеджерЗаписи.AETLRIS_Внешний.Port,"ЧГ="));
		НастройкиСистемыDICOM.Добавить("AETLЛистовХост",МенеджерЗаписи.AETLRIS_Внешний.Host);
		
	Иначе
		// Локальное соединение
		// AETLМенеджера
		НастройкиСистемыDICOM.Добавить("AETLМенеджера",Строка(МенеджерЗаписи.AETLPACS_Внутренний));
		НастройкиСистемыDICOM.Добавить("AETLМенеджераПорт",Формат(МенеджерЗаписи.AETLPACS_Внутренний.Port,"ЧГ="));
		НастройкиСистемыDICOM.Добавить("AETLМенеджераХост",МенеджерЗаписи.AETLPACS_Внутренний.Host);
		
		// AETLЛистов
		НастройкиСистемыDICOM.Добавить("AETLЛистов",Строка(МенеджерЗаписи.AETLRIS_Внутренний));
		НастройкиСистемыDICOM.Добавить("AETLЛистовПорт",Формат(МенеджерЗаписи.AETLRIS_Внутренний.Port,"ЧГ="));
		НастройкиСистемыDICOM.Добавить("AETLЛистовХост",МенеджерЗаписи.AETLRIS_Внутренний.Host);
	КонецЕсли;
	
	//// Директивы для работы - делаем привязку в виде каталога по имени Документа, чтоб не было удаления лишнего 
	//НастройкиСистемыDICOM.Добавить("КаталогХраненияВременных",(МенеджерЗаписи.КаталогХраненияВременныхФайлов + ИмяВременногоКаталога));
	
	Возврат НастройкиСистемыDICOM;
	
КонецФункции 

Функция РегистрDICOMДанныеУчений_Доступен(Доступен) Экспорт
	
	Попытка
		НачатьТранзакцию();
	
		// Получаем набор записей. В регистре DICOMДанныеУченийСРасшифровкой мы отбираем все записи за один документ
		// Т.к. учения уникальны хотя бы в рамках приема.  
		НовыйНаборЗаписей = РегистрыСведений.DICOMДанныеУченийСРасшифровкой.СоздатьНаборЗаписей();
		НоваяЗапись = НовыйНаборЗаписей.Добавить();
		НоваяЗапись.StudyUID = Новый УникальныйИдентификатор;
		НоваяЗапись.Документ = Документы.Прием.ПолучитьСсылку(Новый УникальныйИдентификатор);
		НоваяЗапись.SPSUID = "SPS-001";
		
		НовыйНаборЗаписей.Записать(Истина);
	
	Исключение
		Доступен = Ложь;
	КонецПопытки;
	ОтменитьТранзакцию();
	
	Возврат Доступен;
	
КонецФункции

#КонецОбласти 

#Область Обновление

// Обновление при переходе с функционала DCMTK.
//
Процедура Обновление_ПереходС_DCMTK_ПереносОборудованияВМедОборудование() Экспорт 
	
	// Эта процедура должна вызываться разово - она копирует без проверки повторов оборудование 
	// в справочник МедицинскоеОборудование (соблюдая иерархию);
	// После чего изменяется регистр Оборудования по сотрудникам и таблица ОборудованиеDICOM в Номенклатура,
	// Где мы подбираем медицинское оборудование по уже указанному оборудованию (связь 1 к 1).
	// ВАЖНО, что старое значение Оборудование затирается на пустую ссылку после обновления в таблице!
	// В процессе изменения номенклатуры также преобразуется в строку значение справочника DICOMModality
	// Т.К. DICOMModality больше не будет использован в реализациях DICOM кроме DMTK.
	
	// При первом обновлении в зависимости от версии конфигурации - КОРП или обычная, прописывается регистр DICOM
	ОбновлениеРегистраDICOMПервоеОткрытие();
	
	СоответствиеСтароеНовоеОборудование = Новый Соответствие;
	КешРодителиВсего = Новый Соответствие;
	ПоследовательностьРодителей = Новый Массив;
	
	// Мы перебираем все элементы и получаем их родителей. Чтоб не получать НайтиПоНаименованию ссылку родителя
	// Мы просто складируем её в КешРодителей, где Ключ - наименование родителя.
	ВыборкаОборудование = Справочники.Оборудование.Выбрать();
	Пока ВыборкаОборудование.Следующий() Цикл
		
		// Нас интересуют только элементы-модальности, т.к. только они используются в DICOM
		Если ВыборкаОборудование.ПометкаУдаления ИЛИ Не ЗначениеЗаполнено(ВыборкаОборудование.удалитьAETitle) Тогда		
			Продолжить;			
		КонецЕсли;
				
		// Запоминаем Всю иерархию его родителей. Если родителей нет в КЕШ - мы их создаём и запоминаем
		// Поскольку мы идём от элемента к последнему родителю - мы запоминаем последовательность - кто чей родитель
		ТекущийРодитель = ВыборкаОборудование.Родитель;
		ПоследовательностьРодителей.Очистить();
		
		// Проход от элемента до последнего родителя
		Пока ЗначениеЗаполнено(ТекущийРодитель) Цикл
		
			ПоследовательностьРодителей.Добавить(ТекущийРодитель.Наименование);	
			  
			Если КешРодителиВсего.Получить(ТекущийРодитель.Наименование) = Неопределено Тогда
				
				НовоеМедОборудование = Справочники.МедицинскоеОборудование.СоздатьГруппу();
				НовоеМедОборудование.Наименование = ТекущийРодитель.Наименование;      
				НовоеМедОборудование.Записать();
				КешРодителиВсего.Вставить(ТекущийРодитель.Наименование,НовоеМедОборудование.Ссылка);
			КонецЕсли; 
			
			ТекущийРодитель = ТекущийРодитель.Родитель;
		КонецЦикла;
		
		// Проверяем и записываем - все ли родители иерархически верны
		Для индекс = 0 По (ПоследовательностьРодителей.Количество() - 2) Цикл
		
			ТекущийРодитель = КешРодителиВсего.Получить(ПоследовательностьРодителей[индекс]);	
			Если ЗначениеЗаполнено(ТекущийРодитель.Родитель) Тогда	
				Продолжить;			
			КонецЕсли;
			
			ОбъектРодителя = ТекущийРодитель.ПолучитьОбъект();
			ОбъектРодителя.Родитель = КешРодителиВсего.Получить(ПоследовательностьРодителей[индекс + 1]);
			ОбъектРодителя.Записать();
			
		КонецЦикла;
		
	    // Записываем сам элемент
		НовоеМедОборудование = Справочники.МедицинскоеОборудование.СоздатьЭлемент();

		НовоеМедОборудование.Наименование =  ВыборкаОборудование.Наименование;
		НовоеМедОборудование.НаименованиеПолное = НовоеМедОборудование.Наименование;
		НовоеМедОборудование.ФилиалТекущегоРазмещения = ВыборкаОборудование.Подразделение.Филиал;
		НовоеМедОборудование.AETitle = ВыборкаОборудование.удалитьAETitle; 
		
		Если ПоследовательностьРодителей.Количество() > 0 Тогда		
			НовоеМедОборудование.Родитель = КешРодителиВсего.Получить(ПоследовательностьРодителей[0]);
		КонецЕсли;
		
		НовоеМедОборудование.Записать();
		
		// Оборудование и новое мед. оборудование имеют зависимость 1 к 1
		СоответствиеСтароеНовоеОборудование.Вставить(ВыборкаОборудование.Ссылка,НовоеМедОборудование.Ссылка);	
	КонецЦикла;

	// Обновляем регистры. Если никаких новых преобразований нет - то и обновлять нечего
	Если СоответствиеСтароеНовоеОборудование.Количество() = 0 Тогда	
		Возврат;		
	КонецЕсли;
	
	ОборудСотрудникиВыборка = РегистрыСведений.ОборудованиеСотрудниковDICOM.Выбрать();
	
	Пока ОборудСотрудникиВыборка.Следующий() Цикл
		
		МенеджерЗаписи = ОборудСотрудникиВыборка.ПолучитьМенеджерЗаписи();
	    МенеджерЗаписи.Прочитать();
		
		МенеджерЗаписи.Оборудование = СоответствиеСтароеНовоеОборудование.Получить(МенеджерЗаписи.Оборудование);
		
		МенеджерЗаписи.Записать(Истина);
	КонецЦикла;
	
	// Обновляем Номенклатуру. Т.к. проверяем на наличие данных таблицы, пройдёмся выборкой, а не запросом
	НоменклатураВыборка = Справочники.Номенклатура.Выбрать();	
	
	Пока НоменклатураВыборка.Следующий() Цикл
		
		Если НоменклатураВыборка.ОборудованиеDICOM.Количество() > 0 Тогда		
			ОбъектНоменклатуры = НоменклатураВыборка.ПолучитьОбъект();			
			Для каждого СтрокаТаблицыDICOM Из ОбъектНоменклатуры.ОборудованиеDICOM Цикл
				СтрокаТаблицыDICOM.Оборудование = СоответствиеСтароеНовоеОборудование.Получить(СтрокаТаблицыDICOM.Оборудование);	
			КонецЦикла;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НоменклатураВыборка.DICOMModality) Тогда		
			Если ОбъектНоменклатуры = Неопределено Тогда
				ОбъектНоменклатуры = НоменклатураВыборка.ПолучитьОбъект();
			Иначе
			КонецЕсли;
			
			// В Ворклистах участвует кодовое обозначение, а не полное наименование 
			// Исключение будет срабатывать, если вместо ссылки на справочник тут будет строка
			// Т.к. код обрабатывается единожды как раз таки для преобразования в строку (а на момент исполнение там только ссылки)
			// То исключение будет срабатывать ТОЛЬКО при повторном запуске кода, что не должно происходить
			// Поэтому тут просто Попытка с игнорированием исключения.
			Попытка
				СтрокаКодаМодальности = Строка(НоменклатураВыборка.DICOMModality.Код); 
				ОбъектНоменклатуры.DICOMModality = СтрокаКодаМодальности;
			Исключение			
			КонецПопытки;
		КонецЕсли;

		Если ОбъектНоменклатуры <> Неопределено Тогда
			ОбъектНоменклатуры.Записать();	 
			ОбъектНоменклатуры = Неопределено;	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновлениеРегистраDICOMПервоеОткрытие()

	// Корп имеет всегда метаданные по интеграции DCM4CHEE
	Если Метаданные.ОбщиеМодули.Найти("DCM4CHEEКлиент") <> Неопределено Тогда
	
		МенеджерЗаписи = РегистрыСведений.DICOMНастройкаСистемы.СоздатьМенеджерЗаписи();	
		МенеджерЗаписи.Прочитать();	
		
		// Если изначально заполнено - позволим пользователям пока остаться с DCMTK и нормально настроить самим
		Если Константы.DCMTK_ЗапросыВызываемыйAETitle.Получить().Пустая()
			И Константы.DCMTK_STORESCP_ИспользуемыйAETitle.Получить().Пустая()
			И Константы.DCMTK_MWLSCP_ИспользуемыйAETitle.Получить().Пустая()
			Тогда
			МенеджерЗаписи.ИмяСистемы = "DCM4CHEE";	
		Иначе 
			МенеджерЗаписи.ИмяСистемы = "DCMTK";
		КонецЕсли;
		
		// Запишем
		МенеджерЗаписи.Записать(Истина);			
	
	Иначе
		// В УМЦ нужно проверить, что пользователь уже работал с DICOM (это однозначно используемые AETitle) 
		Если Константы.DCMTK_ЗапросыВызываемыйAETitle.Получить().Пустая()
			И Константы.DCMTK_STORESCP_ИспользуемыйAETitle.Получить().Пустая()
			И Константы.DCMTK_MWLSCP_ИспользуемыйAETitle.Получить().Пустая()
			Тогда
			
			// Настраеваем "пустую" строку регистра,Набор записей на случай "некорректных" данных 
			Константы.ИспользоватьDICOM.Установить(Ложь);
			НаборЗаписи = РегистрыСведений.DICOMНастройкаСистемы.СоздатьНаборЗаписей();
			НаборЗаписи.ИмяСистемы = "";
			НаборЗаписи.Записать(Истина);			
		Иначе	
			МенеджерЗаписи = РегистрыСведений.DICOMНастройкаСистемы.СоздатьМенеджерЗаписи();	
			МенеджерЗаписи.Прочитать();	
			МенеджерЗаписи.ИмяСистемы = "DCMTK";
			МенеджерЗаписи.Записать(Истина);
		КонецЕсли;
		
		
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
